In [13]:
import pandas as pd

In [14]:
employee = pd.read_csv('Employee.csv')
employee

   id     name  salary  departmentId
0   1   Joe      70000             1
1   2   Jim      90000             1
2   3   Henry    80000             2
3   4   Sam      60000             2
4   5   Max      90000             1

In [16]:
department = pd.read_csv('Department.csv')
department

   id   name
0   1     IT
1   2  Sales

In [21]:
employee_department = pd.merge(employee,department, how = 'left', left_on = 'departmentId', right_on = 'id')
employee_department

   id_x   name_x  salary  departmentId  id_y name_y
0     1   Joe      70000             1     1     IT
1     2   Jim      90000             1     1     IT
2     3   Henry    80000             2     2  Sales
3     4   Sam      60000             2     2  Sales
4     5   Max      90000             1     1     IT

In [38]:
employee_department['rank']= employee_department.groupby('name_y')['salary'].rank(method= 'dense', ascending = False)
employee_department[['name_y','name_x','salary']].loc[employee_department['rank'] == 1].rename({'name_y': 'department','name_x': 'employee'},axis='columns')

  department employee  salary
1         IT   Jim      90000
2      Sales   Henry    80000
4         IT   Max      90000